<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"0c5f932b92e541b88213184eebdd69cfa962806f7286df8b3e9122c7248a5c79","plan_job_ref":"Job Pull Request Checks #3024 at https://github.com/GSA-TTS/FAC/actions/runs/9116216679","plan_out_hash":"74564bffbcfffcf11917f4766d55b5075c94ea4b446f64d156a2a6aa458706e6","plan_hash":"24f7fa3824bc7000315af8aafdc3ba4ebf4449f085160dbfa0cad4a04d2ffb72","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 4 to add, 3 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.production.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
        id = "65fbd285-0a4b-cfbe-3445-d40cc279c621"

+       policy {
+           destination_app = "5e81ca8b-99cf-41f8-ae42-76652d51a44c"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.production.module.fac-file-scanner.cloudfoundry_app.scanner_app will be created
+   resource "cloudfoundry_app" "scanner_app" {
+       buildpack                       = "https://github.com/cloudfoundry/python-buildpack"
+       disk_quota                      = 512
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = (known after apply)
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "port"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 512
+       name                            = "fac-file-scanner"
+       path                            = "../shared/modules/scanner/scanner.zip"
+       ports                           = (known after apply)
+       space                           = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "rolling"
+       timeout                         = 180

+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }

+       service_binding {
+           service_instance = "593e554d-fab4-4dc0-bf84-f4f9c39b5620"
        }
+       service_binding {
+           service_instance = "ac8bf271-4c6d-4ee0-bd36-1415b839a93c"
        }
+       service_binding {
+           service_instance = "ca564d14-b89a-4944-a43f-033dca62ab30"
        }
+       service_binding {
+           service_instance = "0eca29d3-e963-49e6-8c9e-c53b7aa8482e"
        }
    }

  # module.production.module.fac-file-scanner.cloudfoundry_route.scanner_route will be created
+   resource "cloudfoundry_route" "scanner_route" {
+       domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b"
+       endpoint = (known after apply)
+       hostname = "fac-file-scanner-production"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
    }

  # module.production.module.file_scanner_clamav.data.cloudfoundry_app.app will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_app" "app" {
+       buildpack                  = (known after apply)
+       command                    = (known after apply)
+       disk_quota                 = (known after apply)
+       enable_ssh                 = (known after apply)
+       environment                = (sensitive value)
+       health_check_http_endpoint = (known after apply)
+       health_check_timeout       = (known after apply)
+       health_check_type          = (known after apply)
+       id                         = (known after apply)
+       instances                  = (known after apply)
+       memory                     = (known after apply)
+       name                       = (known after apply)
+       name_or_id                 = "****************"
+       space                      = (known after apply)
+       stack                      = (known after apply)
+       state                      = (known after apply)
    }

  # module.production.module.file_scanner_clamav.data.cloudfoundry_domain.internal will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal" {
+       domain   = (known after apply)
+       id       = (known after apply)
+       internal = (known after apply)
+       name     = "apps.internal"
+       org      = (known after apply)
    }

  # module.production.module.file_scanner_clamav.data.cloudfoundry_space.space will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_space" "space" {
+       id       = (known after apply)
+       name     = "production"
+       org      = (known after apply)
+       org_name = "gsa-tts-oros-fac"
+       quota    = (known after apply)
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_app.clamav_api must be replaced
-/+ resource "cloudfoundry_app" "clamav_api" {
+       buildpack                       = (known after apply)
!~      enable_ssh                      = true -> (known after apply)
+       health_check_http_endpoint      = (known after apply)
!~      health_check_invocation_timeout = 0 -> (known after apply)
!~      health_check_timeout            = 0 -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      id_bg                           = "************************************" -> (known after apply)
!~      instances                       = 2 -> 4
-       labels                          = {} -> null
        name                            = "fac-av-production-fs"
!~      ports                           = [] -> (known after apply)
!~      space                           = "5593dba8-7023-49a5-bdbe-e809fe23edf9" # forces replacement -> (known after apply) # forces replacement
+       stack                           = (known after apply)
#        (8 unchanged attributes hidden)

-       routes {
-           port  = 0 -> null
-           route = "3d584a52-c592-4879-8de9-11198d2f625d" -> null
        }
+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_network_policy.clamav_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav_routing" {
        id = "22404581-6620-4dc7-9fbb-207db75b10be"

+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_route.clamav_route must be replaced
-/+ resource "cloudfoundry_route" "clamav_route" {
!~      domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b" # forces replacement -> (known after apply) # forces replacement
!~      endpoint = "fac-av-production-fs.apps.internal" -> (known after apply)
!~      id       = "************************************" -> (known after apply)
+       port     = (known after apply)
!~      space    = "5593dba8-7023-49a5-bdbe-e809fe23edf9" # forces replacement -> (known after apply) # forces replacement
#        (2 unchanged attributes hidden)
    }

  # module.production.module.https-proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
        id                              = "5e81ca8b-99cf-41f8-ae42-76652d51a44c"
        name                            = "https-proxy"
!~      source_code_hash                = "48b2f5eba8d1f35c0fbc2f90c2ec87cab180f5f19e7e34b16b9190fe5c5ca09a" -> "e246274fca627d48afccde010de949371f24b6c9974c48aa91044acd36654fa8"
#        (21 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 4 to add, 3 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.domain.cloudfoundry_service_instance.external_domain_instance,
  on /tmp/terraform-data-dir/modules/domain/domain/main.tf line 45, in resource "cloudfoundry_service_instance" "external_domain_instance":
  45:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 5 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Pull Request Checks #3024](https://github.com/GSA-TTS/FAC/actions/runs/9116216679)